# # with open('我发送的文本内容.txt','w') as f:
#     # f.write('世上最牢固的感情不是“我爱你”，而是“我习惯了有你”。彼此依赖，才是最深的相爱。')
#
#
# # with open('加密.txt','w') as f:
# #     f.write('世上最牢固的感情不是“我爱你”，而是“我习惯了有你”。彼此依赖，才是最深的相爱。')
#
# a = '''优美情书句子http://www.1juzi.com/new/2542.html
# 1、世上最牢固的感情不是“我爱你”，而是“我习惯了有你”。彼此依赖，才是最深的相爱。
#
# 2、如今天的每一天，思念与爱念已占据了我的思想，我想控制，可是我没办法，细雨中的相识茶座中的谈心海枯石烂但我的爱永不变！
#
# 3、有人说，只有给予爱情的人才能长久拥有爱情，我想为他付出一切，拥有这份爱情……
#
# 4、曾经，我想和你分享我的所有秘密，但现在，你成了我心底的秘密。
#
# 5、有时候，日夜思念。可是当思念的人出现在眼前，你却安之若素。
#
# 6、我的生命本平凡，但有了你们这些陪我一路走过的朋友，使它变得精彩。我要谢谢你们，因为有了你们，才使我不再孤单。
#
# 7、人们都说恨也是感情，希望日后我们之间只有好的感情。
#
# 8、我看不见阳光，我闻不到花的芬芳，没有色彩的灰色大地，好荒凉。
#
# 9、我可以一个人唱歌，一个人喝咖啡，一个人涂鸦，一个人旅行，一个人逛大街，一个人在雨中漫步，一个人听音乐，一个人自言自语，一个人发呆，一个人跳舞，一个人看电视，一个人翻杂志……只有爱你，是我一个人做不到的。
#
# 10、深夜，是一个人心灵最脆弱的时候，也是想念最疯狂的时候。
#
# 11、据说如果每天读15分钟的书，命运就会发生变化，我觉得只要看着你就会改变命运的。
#
# 12、如果有一天我们变陌生了，那么我就重新认识你。
#
# 13、世界有爱才会温暖，世界有爱才会有依靠，世界有你才会温馨，愿你能和我一路同行，做一对幸福的路人。
#
# 14、我觉得爱情就象是一颗种子，你要给它浇水，给它阳光，细心呵护它，我想这就是爱情的力量，请成为我爱情的种子吧，让我们一起把它培养成大树。
#
# 15、我们的生活有太多无奈，我们无法改变，也无力去改变，更糟的是，我们失去了改变的想法。
#
# 16、有人说，只有给予爱情的人才能长久拥有爱情，我想为他付出一切，拥有这份爱情。
#
# 17、矛盾像首尾互接的鱼，在这个世界中长久地存活着。
#
# 18、回想起我们在一起的日子，我就忍不住一阵阵的心痛不是曾经说好了不要分开的吗？你怎么忍心就这样丢下我一个？
#
# 19、你的身影越来越频繁地出现在我的眼前，渐渐地，意如呼吸一般，一秒钟也不中断，弄得我吃不好饭，睡不好觉。
#
# 20、我明知道那花是冲着他飞过去的，我横刀夺了过来，请接受我的花，我会连同他的那份让你幸福的。
#
# 21、自己一个人逛街，一个人散心，一个人听音乐，一个人游荡……什么都是，我自己一个人。
#
# 22、世界上最残忍的事，不是没遇到爱的人，而是遇到却最终错过；世界上最伤心的事，不是你爱的人不爱你，而是他爱过你后，最后却不爱你。
#
# 23、最难送出去的情书是第一封和第一万封。送第一封情书需要多大的勇气，送第一万封情书需要多大的毅力。
#
# 24、如果当初我勇敢，结局是不是不一样。如果当时你坚持，回忆会不会不一般。最终我还是没说，你还是忽略。
#
# 25、我曾路过你的心，不是我不想停留，而是你不肯收留。
#
# 26、真正的爱情，应该是两个人，彼此理解，互相尊重，不缠绕，不牵绊，不占有，然后相伴，走过一段漫长的旅程。如果我遇见你，就会紧紧抓住你。
#
# 27、我希望秋天覆盖轨道，所有的站牌都写着八月未完。在季节的列车上，如果你要提前下车，请别推醒装睡的我。这样我可以沉睡到终点，假装不知道你已经离开。
#
# 28、总有一天你会遇上那么一个人，他让你的欢笑和泪水都有意义，他善待你，把你当成生命中最重要的那个。
#
# 29、在乎才会乱想，不在乎连想都不会想。
#
# 30、乔妈看过了情书，却又多买了一本送我，说是让我随便挑，后来又要我拿情书，我这里还没细看，似乎是情感在作怪，我又有些不太懂，可情书终究写的是没有勇气告知的遗憾。
#
# 31、天空中有你我最喜爱的颜色，现实中有你我最相配的角色。白云依靠着蓝天，蓝天包容着白云，就像现在的你和我，多美！
#
# 32、一生长长短短的时光，与你有关的日子才是最幸福的。
#
# 33、我不知道是否抬起头，天空就会亮起来，但是我知道，如果一直低着头无论如何都不会亲眼看到蔚蓝的天空。
#
# 34、我希望我的下一场恋爱，要么，不开始。要么，一辈子。
#
# 35、将这一份领悟，写一封情书，送给我自己，感动得要哭，很久没哭，不失为天大的幸福，用这一封情书，给自己祝福，可以不在乎，才能对别人在乎。
#
# 36、我是你闲坐窗前的那棵橡树，我是你初次流泪时手过的书，我是你春夜注视的那段蜡烛，我是你秋天穿上的楚楚衣物。
#
# 37、有一种爱，明明是深爱，却说不出来。有一种爱，明明想放手，却无法离弃。有一种爱，明知是煎熬，却又躲不开。有一种爱，明知无前路，心却早已收不回来。
#
# 38、闭上眼，以为我能忘记，但流下的眼泪，却没有骗到自己。
#
# 39、不要总是问我倒底爱你些什么，我不要短暂的温存，只要你一世的陪伴
#
# 40、我希望，离别的离别的离别之后，我们总能再相聚。
#
# 41、世界上没有任何东西可以永恒。如果它流动，它就流走；如果它存着，它就干涸；如果它生长，它就慢慢凋零。
#
# 42、无数次拿起电话，无数次浪费我的电话卡，为什么每次都是我打电话，因为我爱你。
#
# 43、我藏不住秘密，也藏不住忧伤，正如我藏不住爱你的喜悦，藏不住分离时的彷徨。
#
# 44、我最幸福的时刻，就是找对了人句子大全http://Www.1juzI.coM/。你纵容我的习惯，并爱着我的一切！
#
# 45、我的眼睛深情地注视着你的眼睛，就像大海般蔚蓝，纯净得揉不进一粒小小的细沙。
#
# 46、等待，不是为了你能回来，而是找个借口不离开。
#
# 47、我发现你一直住在我心里某个角落，拿着永不过期的凭证，成了永久的居民。
#
# 48、那一年，那片海，那首歌，那过去的美好，都是我半夜流泪的借口。
#
# 49、生命从来不是公平的，得到多少，便要靠那个多少做到最好，努力的生活下去。
#
# 50、我以为爱情可以克服一切，谁知道她有时毫无力量。我以为爱情可以填满人生的遗憾，然而，制造更多遗憾的，却偏偏是爱情。阴晴圆缺，在一段爱情中不断重演。换一个人，都不会天色常蓝。
#
# 51、因为想要把你忘记真的好难，好舍不得我是铁了心的爱你。
#
# 52、爱不是彼此凝视，而是一起注视着同一个方向。
#
# 53、每天早上醒来，看见你和阳光都在，这就是我想要的未来。
#
# 54、你看，这么多人，这么大的世界。我遇到了你，你也遇到了我。挺好。
#
# 55、如果说这朵花是抛给我的，那我的心脏就是为了你而跳的。。
#
# 56、如果有人问我为什么爱你，我觉得我只能如此回答：“因为是你，因为是我。”
#
# 57、这辈子最疯狂的事，就是爱上了你，最大的希望，就是有你陪我疯一辈子。
#
# 58、最幸福的事情，就是每天与你分享，平凡生活的点点滴滴。
#
# 59、世事如书，我偏爰你这一句，愿做个逗号，呆在你脚边。但你有自己的朗读者，而我只是个摆渡人。
#
# 60、真正的忘记，不是不再想起，而是想起你时内心不再有波澜。
#
# 61、无论你在哪里，在谁身边，我永远是那个最牵挂你的笨蛋。
#
# 62、"一个人只有今生今世是不够的，他还应当有诗意的世界。
#
# 63、不要总是问我到底爱你些什么，你要知道爱一个人是不需要理由的。
#
# 64、时间的巨轮无法抹去我对你的思念纵使海枯石烂，你的身影永存於我心中。
#
# 65、爱情不是在下雨天为对方打伞，而是两个人一起淋雨……
#
# 66、人总有想哭的时候，你总会用你的双手，悄悄地抚平了我的伤口，不会让别人知道。
#
# 67、如果你的美丽是上天送给你的最好的礼物的话，那么让我遇见你就是上天对我的最好的恩赐。
#
# 68、一个人的孤独不是孤独，一个人找另一个人，一句话找另一句话，才是真正的孤独
#
# 69、你的灵魂太透明了我都看不到你了。
#
# 70、对你，我已经无条件投降了，你就签下爱情合约吧不然没人要我了，我已准备好将权利减半、义务倍增了。
#
# 71、爱情是将伤心作为担保而借来的幸福。
#
# 72、我爱你，不是因为这里只有你而爱你，而是因为只想爱你一个人。
#
# 73、我是一个很怕主动联系别人的人。如果我主动找你，那是因为你在我心里很重要。如果我不主动找你，不是因为你不重要，而是我不知道在你心里我是否重要。
#
# 74、空白的日子有你来填满，无论是平静还是灿烂，我都喜欢。人生的旅途有你来做伴，不管是坎坷抑或平坦，我都情愿。
#
# 75、没用的东西，再便宜也不要买；不爱的人，再寂寞也不要依赖。
#
# 76、我觉得处处都有爱的悸动，我也想在这样的悸动中与他有一段纯净的感情。
#
# 77、我可以为了我爱的人什么都能做，像妈妈一样的女人，像朋友一样的女人，像妹妹一样的女人，比100句假话，不如用真实的接受我温馨的眼神和心。
#
# 78、找一个人，和我一起慢慢衰老，感到荣幸，你呢？
#
# 79、“心是自己的，痛的只能是你自己。”我对你说这话的时候，风刮着沙子住进了我的眼。80、我拒绝那么多的暧昧，只为了你一个不确定的未来。'''
# s = []
# for i in a:
#     s.append(i)
# print(s)
# w = 0
# for j in set(s):
#     w+=1
#     with open('密码本.txt','a') as f:
#         f.write('{} {}'.format(j,w)+'\n')

import re
import numpy as np
import os



dict_str = {}
for line in open('密码本.txt'):
    dict_str[line.split(' ')[0]] = re.sub('[\r\n\t]', '', line.split(' ')[-1])

aq = '人们都说恨也是感情，希望日后我们之间只有好的感情。'

list_jm_jz = []
list_ys = []
for i in aq:
    if i in dict_str:
        list_ys.append(int(dict_str[i]))
        print(list_ys)
        if len(list_ys) == 4:
            print(list_ys)
            list_jm_jz.append(list_ys)
            list_ys = []

if len(list_ys) != 0:
    while True:
        list_ys.append(1)
        if len(list_ys) == 4:
            list_jm_jz.append(list_ys)
            list_ys = []
            break



W = np.mat(list_jm_jz)#转换为矩阵
K = np.mat([[1,0,1,3],[3,2,7,4],[1,9,2,1],[1,4,5,2]])#钥匙
C = W*K
for i in C.tolist():
    for j in i:
        print(j)
        with open('我发送的密文.txt','a') as f:
            f.write(str(j)+'\n')


#解谜
